---
kind: type
id: T:Autodesk.Revit.DB.BuiltInFailures.DocumentFailures
source: html/51cc3f4c-5e1f-90e9-896a-db461e14ed43.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DocumentFailures

Failures about DocumentFailures.

## Syntax (C#)
```csharp
public static class DocumentFailures
```